"""
у матриці 4*4, що задана користувачем замініть всі від’ємні елементи на 0.
щоб ви не мучились і не вводили багато чисел, так як матриця 4*4, я викликала рандом, але якщо потрібно я можу замінити,щоб вводив користувач
Олійник Богдан Сергійович 122\Д
"""
import random
import numpy as np
i = 4
j = 4
mac = np.zeros ((i, j), dtype = np.int_) # Створюємо двовимірний масив розміром i*j
for x in range(4):
    for y in range(4):
        mac[x,y]=random.randint(-10,10)
for z in range (i):
    for b in range (j):
        if mac [z, b] < 0: # якщо рандом видасть від'ємні числа то це число заміниться на 0
           mac [z, b] = 0 
print ( 'Кінечна матриця:  \n', mac)
