"""
Бінарий пошук

Олійник Богдан Сергійович 122\Д

Тестирование программы
"""

import numpy as np
import random
m1 = np.array(range(1,15))  #Створимо масив для перевірки правильності нашого пошуку.
print(m1)
x = int(input('Введіть елемент для пошуку: '))#Якщо користувач введе більше 14, то елемент знайдений не буде
R = len(m1)-1 #Кінець масиву
L,count,k = 0,0,0, #Початок масиву, лічильник для порівнянь, і змінна для позиції числа
flag = False
while L <= R and not flag :
    k = (L+R) // 2 #Припустимо, якщо ввести 9, При першій ітерації, к = 6, при другій к = 10 при третин к = 8
    count += 1   #Лічильник ітерацій
    if m1[k] == x:
        flag = True
    elif m1[k] < x:
        L = k+1
    else:
        R = -1
if not flag:
    print('Елемент не знайдено')
else:
    print(f'Елемент знайдений на позиції {k} за {count} порівнянь')
#Робота з рандомних значеннями
m2 = np.zeros(20,dtype=int)
for i in range(20):
    m2[i] = random.randint(-10,10)
print(m2)
R1 = len(m2)-1 #Кінець масиву
L1,count1,k1 = 0,0,0, #Початок масиву, лічильник для порівнянь, і змінна для позиції числа
flag1 = False
while L1 <= R1 and not flag1 :
    k1=(L1 + R1) // 2
    count1 += 1   #лічильник ітерацій
    if m2[k1] == x:
        flag1 = True
    elif m2[k1] < x:
        L1 = k1+1
    else:
        R1 = k1-1
if not flag1:
    print('Елемент не занайдений')
else:
    print(f'Елемент знайдений на позиції {k1} за {count1} порівнянь')

