"""
Прямий пошук підрядка

Олійник Богдан Сергійович 122\Д
"""
s='Дмитро мав 10 яблук а Олена 12 груш ' 
print(s)
s1 = input('Введіть підрядок: ')#Підрядка не буде знайдена, якщо її не буде в рядку, тоді виведе що підрядок не знайдено
i = -1 #індекси рядки
j = 0#Індексі підрядка 
while (j < len(s1)) and i < (len(s) - len(s1)):
    j = 0
    i += 1 #Кількість зсувів, і наша позиція
    while j < len (s1) and s1[j] == s[i+j]:
        j+=1
if (j==len(s1)):
    print(f'Підрядок знайдений в позиції {i} , за {i} переміщень')
else:
    print('Підрядок не знайдений')
